scripts/global/1609/32728820

<p>I've tried everything I can and now I need help. I'm trying to consume a payment gateway web service (<a href="https://secure.paygate.co.za/PayBatch/PayBatch.wsdl" rel="nofollow">Payget WSDL</a>) and I'm getting the error: "SOAP-ERROR: Encoding: Violation of encoding rules". The problem is whatever xml is generated, is generated by .NET and I've no control of the outcome xml if it is invalid or not. From their documentation they expect XML similar to:</p>  <pre><code>&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;    &lt;Body&gt;      &lt;Auth xmlns="urn:paygate.paybatch"&gt;        &lt;BatchReference&gt;NewBatch1&lt;/BatchReference&gt;        &lt;NotificationUrl&gt;&lt;/NotificationUrl&gt;        &lt;BatchData&gt;             &lt;BatchLine&gt;A,INV01,Joe Soap,06a55ccf-d4fb-4f8a-9c3c-ad54c5f3b9c1,00,3299&lt;/BatchLine&gt;             &lt;BatchLine&gt;A,INV02,Mr Jones,13ab61b6-7c66-4d52-ae4f-13a472a168c2,12,15995&lt;/BatchLine&gt;        &lt;/BatchData&gt;      &lt;/Auth&gt;    &lt;/Body&gt; &lt;/Envelope&gt; </code></pre>  <p>But the output xml that .NET generates when I make a request looks like:</p>  <pre><code>&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;     &lt;s:Body s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;         &lt;q1:Auth xmlns:q1="urn:paygate.paybatch"&gt;             &lt;BatchReference xsi:type="xsd:string"&gt;d18001d3-4ab0-441d-849a-a3ad9d6405cb&lt;/BatchReference&gt;             &lt;NotificationUrl xsi:type="xsd:string"&gt;http://www.website.com/PaygetNotify&lt;/NotificationUrl&gt;             &lt;BatchData href="#id1"/&gt;         &lt;/q1:Auth&gt;         &lt;q2:BatchData id="id1" xsi:type="q2:BatchData" xmlns:q2="urn:paygate.paybatch"&gt;             &lt;BatchLine href="#id2"/&gt;         &lt;/q2:BatchData&gt;         &lt;q3:Array id="id2" q3:arrayType="xsd:string[1]" xmlns:q3="http://schemas.xmlsoap.org/soap/encoding/"&gt;             &lt;Item&gt;A,d93b9710-92d1-4db2-ae6c-9aa158041498,Name 8 Surname 8,234569,00,6600&lt;/Item&gt;         &lt;/q3:Array&gt;     &lt;/s:Body&gt; &lt;/s:Envelope&gt; </code></pre>  <p>As you can see, there's a difference in the expected xml from the one generated by .NET. Could that be the reason to why I'm getting that error? Is there a way I can make .NET generate the xml as expected by the wsdl specification? Am I doing something wrong? Below is the app.config for the wsdl:</p>  <pre><code>&lt;system.serviceModel&gt;         &lt;bindings&gt;             &lt;basicHttpBinding&gt;                 &lt;binding name="PaybatchBinding"&gt;                   &lt;security mode="TransportWithMessageCredential"&gt;                     &lt;message clientCredentialType="UserName" /&gt;                   &lt;/security&gt;                 &lt;/binding&gt;                 &lt;binding name="PaybatchBinding1" /&gt;             &lt;/basicHttpBinding&gt;         &lt;/bindings&gt;         &lt;client&gt;             &lt;endpoint address="https://secure.paygate.co.za/paybatch/process.trans"                 binding="basicHttpBinding" bindingConfiguration="PaybatchBinding"                 contract="PayGate.PaybatchPortType" name="paybatchPort" /&gt;         &lt;/client&gt;     &lt;/system.serviceModel&gt; </code></pre>  <p>I added the service reference the normal Right Click Add Service Reference and Visual Studio auto generates everything. Below is how I make a request:</p>  <pre><code>PaybatchPortTypeClient payget = new PaybatchPortTypeClient();                  payget.ClientCredentials.UserName.UserName = Variables.SystemRules.PaygateId;                 payget.ClientCredentials.UserName.Password = Variables.SystemRules.PaygatePsw;  BatchData batchData = new BatchData(); batchData.BatchLine = String[] {"A","d93b9710-92d1-4db2-ae6c-9aa158041498","Name 8 Surname 8","234569","00","6600"}; BatchReturn batchReturn = payget.Auth( "NewBatchId1", "http://www.website.com/PaygetNotify", batchData ); </code></pre>  <p>Please any help would assist, I've finally googled the whole google now and don't what to do.</p>  <p>Thanks in advance to all.</p>